j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Why should the state provide a safe space for undocumented immigrants?
   CLOSED: [2018-06-23 Sat 09:23]
   :PROPERTIES:
   :EXPORT_FILE_NAME: safe-space
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
The Ho`okipa bill introduced to the Hawai`i State Legislature in 2018 would have
provided a safe place for undocumented immigrants. Why should the State do that?

*** Background:
The [[https://www.capitol.hawaii.gov/measure_indiv.aspx?billtype=SB&billnumber=2290&year=2018][Ho`okipa bill introduced in 2018]] does not provide any additional
protections to undocumented immigrants than it does to citizens.

Here is its description:
#+BEGIN_QUOTE
Prohibits state law enforcement agencies from complying with federal immigration
detainers or honoring requests for non-public information unless specifically
required to do so by a warrant signed by a judge or federal, state, or local
law.
#+END_QUOTE

There is no law requiring the State or its counties to assist the federal
Immigration and Customs Enforcement agency (ICE), and the Ho`okipa  bill
merely limits Hawaii’s local law enforcement agencies from assisting ICE, except
as required by law.

Some state and local governments across the nation do provide assistance to ICE,
while [[https://en.wikipedia.org/wiki/Sanctuary_city][more than 500 other state and local governments]] refuse to do so because
they believe assisting ICE will disrupt their communities.

*** Answer:
The Ho`okipa bill introduced to the Hawai`i State Legislature in 2018 does not
provide a safe place for undocumented immigrants. It simply directs local law
enforcement agents to assist the federal Immigration and Customs Enforcement
agency (ICE) only as required by law.

