j20-immigration/content/post/safe-space.md
+++
title = "Why should the state provide a safe space for undocumented immigrants?"
author = ["Hawaii J20"]
date = 2018-06-23T09:23:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
[menu.main]
  weight = 2006
  identifier = "why-should-the-state-provide-a-safe-space-for-undocumented-immigrants"
+++

## Question: {#question}

The Ho\`okipa bill introduced to the Hawai\`i State Legislature in 2018 would have
provided a safe place for undocumented immigrants. Why should the State do that?


## Background: {#background}

The [Ho\`okipa bill introduced in 2018](https://www.capitol.hawaii.gov/measure%5Findiv.aspx?billtype=SB&billnumber=2290&year=2018) does not provide any additional
protections to undocumented immigrants than it does to citizens.

Here is its description:

> Prohibits state law enforcement agencies from complying with federal immigration
> detainers or honoring requests for non-public information unless specifically
> required to do so by a warrant signed by a judge or federal, state, or local
> law.

There is no law requiring the State or its counties to assist the federal
Immigration and Customs Enforcement agency (ICE), and the Ho\`okipa  bill
merely limits Hawaii’s local law enforcement agencies from assisting ICE, except
as required by law.

Some state and local governments across the nation do provide assistance to ICE,
while [more than 500 other state and local governments](https://en.wikipedia.org/wiki/Sanctuary%5Fcity) refuse to do so because
they believe assisting ICE will disrupt their communities.


## Answer: {#answer}

The Ho\`okipa bill introduced to the Hawai\`i State Legislature in 2018 does not
provide a safe place for undocumented immigrants. It simply directs local law
enforcement agents to assist the federal Immigration and Customs Enforcement
agency (ICE) only as required by law.
